{
  "legislative_session": "153",
  "identifier": "HB 183",
  "title": "AN ACT TO AMEND TITLE 15 OF THE DELAWARE CODE RELATING TO SPECIAL ELECTIONS FOR GENERAL ASSEMBLY.",
  "from_organization": "~{\"classification\": \"lower\"}",
  "classification": [
    "bill"
  ],
  "subject": [],
  "abstracts": [
    {
      "note": "synopsis",
      "abstract": "This Act adds the opportunity for special primary elections in special elections for vacancies in either house of the General Assembly. \r\n\r\nThis Act shortens the time between some steps in the process so that if there is a special primary election, the special general election will only be between 35 and 50 days after the special election is held under current law. The time periods under this Act accommodate 10 days of early voting before the day of each election and are feasible with current technology and practices. Early voting and absentee voting requirements and procedures remain the same as for regular elections.\r\n\r\nUnder this Act, the general procedure for special elections to fill a vacancy in the General Assembly is as follows:\r\n•\tThe initial writ of election must be issued within 5 days of the creation of the vacancy. This writ will provide the date of the special primary election and the deadlines for candidates to file and withdraw.\r\n•\tThe special primary election must be held between 35 and 40 days after the date of the writ unless specific provisions for vacancies that occur 6 months before a general election apply.\r\n•\tCandidates have 5 days to file and must schedule the appointment necessary for a criminal history background check no more than 48 hours after the filing deadline.\r\n•\tThe Department of Elections (Department) will provide notice of the candidates who have filed to political parties and if there are no candidates for a political party, the party has 5 days to submit a nomination to the Department.\r\n•\tWithin 24 hours after the deadline for a candidate to withdraw, the State Election Commissioner must provide notice to the officer who issued the writ of election that states if a special primary election is necessary. After receiving this notice, the officer does either of the following:\r\n  1. If a special primary election is not necessary, the officer will issue an amended writ of election establishing that the special general election will be held on the date provided in the initial writ of election.\r\n  2. If a special primary election is necessary, the officer will issue a supplemental writ of election setting the date for the special general election which must be between 35 and 40 days from the date of the special primary election.\r\n\r\nTo avoid holding elections too close together to be feasible for the Department and holding multiple elections for the same office within a few months, the general procedure for special elections under this Act is modified if a special election would otherwise be held within 6 months of a general election as follows:\r\nIf the vacancy is for an office that is on the general election ballot and the date for the special primary election would be on or after May 15, a special primary election is not held. In this situation, \r\n•\tIf the special primary election would be on or before the primary election, the deadline to provide notification of candidacy for that office is extended until 25 days before the date of the primary election.\r\n•\tIf the special primary election would be after the primary election, current law is unchanged, allowing a political party committee to file a supplemental certificate of nomination under § 3306 of Title 15.\r\n\r\nIf the vacancy is for an office that is not on the general election ballot, the special elections are held as follows:\r\n•\tIf the date of the special primary election would be after June 30 and on or before the date of the primary election, the special primary election is held on the day of the primary election and the special general election is held on the day of the general election.\r\n•\tIf the date of the special primary election would be after the day of the primary election, the date of the special primary election is 35 to 40 days after the general election and the special general election is held 35 to 40 days later.\r\n\r\nThis Act also makes technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual."
    }
  ],
  "other_titles": [],
  "other_identifiers": [],
  "actions": [
    {
      "description": "Introduced and Assigned to Elections & Government Affairs Committee in House",
      "date": "2025-05-22",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Elections & Government Affairs",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    }
  ],
  "sponsorships": [
    {
      "name": "Mara Gorman",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Mara Gorman\"}",
      "organization_id": null
    },
    {
      "name": "Franklin D. Cooke",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Franklin D. Cooke\"}",
      "organization_id": null
    },
    {
      "name": "Bryant L. Richardson",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Bryant L. Richardson\"}",
      "organization_id": null
    }
  ],
  "related_bills": [],
  "versions": [
    {
      "note": "Bill Text",
      "links": [
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GenerateHtmlDocument?legislationId=142372&legislationTypeId=1&docTypeId=2&legislationName=HB183",
          "media_type": "text/html"
        },
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GeneratePdfDocument?legislationId=142372&legislationTypeId=1&docTypeId=2&legislationName=HB183",
          "media_type": "application/pdf"
        }
      ],
      "date": "",
      "classification": ""
    }
  ],
  "documents": [
    {
      "note": "Fiscal Note",
      "links": [
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GetPdfDocument?fileAttachmentId=649787",
          "media_type": "application/pdf"
        }
      ],
      "date": "",
      "classification": ""
    }
  ],
  "citations": [],
  "sources": [
    {
      "url": "https://legis.delaware.gov/BillDetail?LegislationId=142372",
      "note": "text/html"
    }
  ],
  "extras": {},
  "jurisdiction": {
    "id": "ocd-jurisdiction/country:us/state:de/government",
    "name": "Delaware",
    "classification": "state",
    "division_id": "ocd-division/country:us/state:de"
  },
  "_processing": {
    "logs_latest_update": "2025-11-26T06:11:36Z"
  }
}