{"legislative_session": "153", "identifier": "SB 95", "title": "AN ACT TO AMEND TITLE 8 OF THE DELAWARE CODE RELATING TO THE GENERAL CORPORATION LAW.", "from_organization": "~{\"classification\": \"upper\"}", "classification": ["bill"], "subject": [], "abstracts": [{"note": "synopsis", "abstract": "This Act continues the practice of amending periodically the Delaware General Corporation Law (“DGCL”) to keep it current and maintain its national preeminence. The following is a section-by-section review of the proposed amendments to the DGCL.\r\n\r\nSections 1, 3 and 4 of this Act amend §§ 102(f), 109(b) and 115 of Title 8, respectively. Since 2015, the provisions of §§ 102(f), 109(b) and 115 have included provisions for the regulation of “internal corporate claims” as defined in § 115. In addition to permitting forum selection provisions that require internal corporate claims to be adjudicated in a court in this State, these sections prohibit certificate of incorporation and bylaw provisions that purport to: \r\na. impose “fee-shifting” against stockholders with respect to internal corporate claims; or \r\nb. preclude a stockholder from asserting an internal corporate claim in a court in this State.  \r\n\r\nA certificate of incorporation may address and regulate not only internal corporate claims but additional claims that relate to a corporation’s “intra-corporate affairs” if the certificate provision at issue is consistent with public policy.  Salzberg v. Sciabacucchi, 227 A.3d 102 (Del. 2020).\r\n\r\nSections 1, 3 and 4 of this Act amend §§ 102(f), 109(b) and 115 so that the same statutory safeguards that apply to certificate and bylaw provisions regulating internal corporate claims will also apply to certificate and bylaw provisions addressing the intra-corporate affairs claims permitted under the reasoning of the Salzberg decision. With respect to these claims: \r\na. Amended §§ 102(f) and 109(b) prohibit fee-shifting provisions: that is, certificate of incorporation and bylaw provisions that purport to impose liability on a stockholder for the attorneys’ fees or expenses of the corporation or any other party with respect to any claim that a stockholder has brought, in its capacity as a stockholder or in the right of the corporation, in an action, suit, or proceeding.  \r\nb. Amended § 115 specifies that a certificate of incorporation or bylaw provision addressing intra-corporate affairs claims must be consistent with applicable jurisdictional requirements and must allow stockholders to bring the claims in at least 1 court in this State that has jurisdiction over such claims.  Amended § 115 permits the designation of any judicial or arbitral forum so long as the designation does not prevent a stockholder from bringing claims in a court with jurisdiction in this State.  The United States District Court for the District of Delaware is a court “in” this State for purposes of amended § 115.\r\n\r\nRather than specifically defining the types of non-internal claims that constitute intra-corporate affairs claims, amended § 115 authorizes forum selection provisions that relate to “the business of the corporation, the conduct of its affairs, or the rights or powers of the corporation or its stockholders, directors or officers.” This language is taken from §§ 102(b)(1) and 109(b). The Salzberg decision relied on similar language from § 102(b)(1) to uphold the validity of forum selection provisions related to certain intra-corporate affairs claims. It is anticipated that the courts will interpret and apply amended § 115 in the same manner that the Delaware Supreme Court interpreted and applied the language of § 102(b)(1) in the Salzberg decision. Amended § 115 is not intended to promote the development of new forum selection provisions beyond what is permitted under the reasoning of the Salzberg decision.  \r\n\r\nUnder amended § 115, a forum selection provision addressing non-internal corporate claims cannot prohibit claims from being brought in a court in this State “that has jurisdiction over such claims.” Amended § 115 therefore reaches a result different from the United States Court of Appeals for the Ninth Circuit in Lee v. Fisher, 70 F.4th 1129 (9th Cir. 2023), and the United States District Court for the Western District of Texas in Sobel v. Thompson, 2023 WL 4356066 (W.D. Tex. July 5, 2023). In these decisions, the courts upheld the application of a forum selection bylaw that required all derivative claims to be asserted exclusively in the Court of Chancery, including derivative claims under the Securities Exchange Act of 1934. However, the Court of Chancery does not have jurisdiction over Securities Exchange Act claims. Under amended § 115, a forum selection provision that purports to address derivative claims under federal law must be permissible under § 115, consistent with the reasoning in the Salzberg decision, and must also permit the claim to be brought in the United States District Court for the District of Delaware.\r\n\r\nConsistent with the provisions pre-dating these amendments:\r\na. Amended §§ 102(f), 109(b) and 115 are not intended to prevent the application of a provision on fee-shifting, or the selection of a forum other than a court in this State, if the provision is included in a stockholder agreement or other writing signed by the stockholder against whom the provision is to be enforced;\r\nb. Amended § 115 is not intended to foreclose evaluation of whether the specific terms and manner of adoption of a particular provision authorized by amended § 115 comport with any relevant fiduciary obligation or operate reasonably in the circumstances; and\r\nc. Amended § 115 is not intended to limit or expand the jurisdiction of the Court of Chancery or the Superior Court.\r\n\r\nSection 2 of this Act amends § 103(f), which provides for the correction of instruments filed with the Secretary of State. The amendment confirms that, in addition to correcting a previously filed instrument, a certificate of correction may nullify a previously filed instrument by specifying the inaccuracy or defect with respect to such previously filed instrument and providing that the previously filed instrument is nullified. A statement that the previously filed instrument is nullified or void, or a statement with words of similar meaning, will constitute sufficient provision for the nullification. \r\n\r\nSection 5 of this Act amends § 131, which requires a corporation to have a registered office in this State. In addition to enacting wording changes to § 131(a), the amendments to § 131(b) provide that all references in Title 8 to a corporation’s “registered office” in this State shall be deemed to mean and refer to the address of the registered agent located in this State that has been appointed to accept service of process and otherwise perform the duties of a registered agent. The amendments also delete the provisions in § 131(b) that, in certain instances, deemed a corporation’s registered office to be the corporation’s principal office or principal place of business in this State for purposes of Title 8 and the certificate of incorporation. As amended, Title 8 does not include provisions that automatically treat a corporation’s registered office as a principal office or principal place of business of the corporation.  \r\n\r\nSection 6 of this Act amends § 132(b), which addresses certain duties of a registered agent of a corporation. Amended § 132(b) specifies that a registered agent may not perform its duties or functions solely through the use of either or both of a virtual office or the retention by the agent of a mail forwarding service. Amended § 132(b) defines “virtual office” as the performance of duties or functions solely through the internet or solely through other means of remote communication.\r\n\r\nSection 7 of this Act amends § 155 to eliminate the ability of a corporation to issue scrip or warrants in bearer form in lieu of issuing fractional shares of stock. Amended § 155 continues to permit corporations to issue scrip or warrants in registered form. The amendment is intended to bring § 155 in line with the Corporate Transparency Act, 31 U.S.C. § 5336(f), which prohibits corporations from issuing certificates in bearer form for either a whole or fractional interest in an entity.\r\n\r\nSection 8 of this Act amends § 252(c), which lists the information that a corporation must include in a certificate filed with the Secretary of State to merge or consolidate domestic corporations with foreign corporations. The amendments delete from § 252(c) a requirement that a certificate of merger or consolidation list the authorized capital stock of each foreign corporation that has ceased to exist as a result of the merger or consolidation.  \r\n\r\nSection 9 of this Act amends § 311, which addresses the procedures for revoking the dissolution of a corporation and restoring an expired corporation. Amended § 311(a)(4) requires that a certificate of revocation of dissolution or certificate of restoration state the date of filing of the corporation’s original certificate of incorporation with the Secretary of State and state the date of filing of the corporation’s certificate of dissolution with the Secretary of State.  \r\n\r\nSection 10 of this Act amends § 312, which enables a corporation to revive its certificate of incorporation after the certificate has become forfeited or void. Amended § 312(g) addresses circumstances where a corporation has been revived under § 312 and later files a certificate of validation under § 204 to ratify one or more defective corporate acts. If the certificate of validation relates to a time during which the corporation was forfeited or void, amended § 312(g) requires the corporation to file the annual franchise tax reports, and pay the annual franchise taxes, that would have been required to be filed, and paid, during the period that the certificate of incorporation had been forfeited or void. The franchise taxes owed include the interest accrued on the taxes, and the filings and payments must be made at the time the certificate of validation is filed.  \r\n\r\nSection 11 of this Act amends § 377. Among other things, § 377 addresses the procedures that a foreign corporation must follow to reinstate its qualification to do business in this State after the qualification has been forfeited under § 132 or § 136. In connection with such a reinstatement, amended § 377(e) requires a foreign corporation to file all annual reports and pay all required fees that would have been required to be filed or paid during the time the foreign corporation’s qualification to do business in this State had been forfeited.  \r\n\r\nSection 12 of this Act amends § 502, which requires a corporation to file an annual report with the Secretary of State. Amended § 502(a) requires that the report disclose the nature of the business of the corporation and confirms that no office of any registered agent may be disclosed as the address of the principal place of business of the corporation, except where the corporation maintains its principal place of business in this State and serves as its own registered agent. The paragraphs of amended § 502(a) have also been re-numbered.   \r\n\r\nSection 13 of this Act amends § 503, which provides the rates and means of computing franchise taxes. Amended § 503(e) provides that the filing of a certificate of validation to ratify one or more defective corporate acts pursuant to § 204 will not reduce the interest owed on the franchise taxes owed for prior periods and specifies that a corporation is not entitled to a franchise tax refund for any period prior to the filing of the certificate of validation. The amendments also repeal § 503(h), which specified an alternative franchise tax rate for regulated investment companies.    \r\n\r\nSection 14 of this Act amends § 505 by clarifying that a corporation is not entitled to a refund of taxes, penalties or interest in connection with filing a certificate of correction under § 103(f) or a certificate of validation under § 204.\r\n\r\nSection 15 of this Act provides that Sections 1 through 12 and Section 14 of this Act take effect on August 1, 2025.\r\n\r\nSection 16 of this Act provides that § 503(h), as contained in Section 13 of this Act, takes effect for tax years beginning on or after January 1, 2026. Section 16 of this Act also provides that § 503(e), as contained in Section 13 of this Act, takes effect on August 1, 2025.\r\n\r\nThis Act requires a greater than majority vote for passage because § 1 of Article IX of the Delaware Constitution requires the affirmative vote of two-thirds of the members elected to each house of the General Assembly to amend the general corporation law."}], "other_titles": [{"note": "short title", "title": "General Corporation Law/Updates"}], "other_identifiers": [], "actions": [{"description": "Introduced and Assigned to Judiciary Committee in Senate", "date": "2025-04-08", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["introduction", "referral-committee"], "related_entities": [{"name": "Judiciary", "entity_type": "organization", "organization_id": null}]}, {"description": "Reported Out of Committee (Judiciary) in Senate with 2 Favorable, 2 On Its Merits", "date": "2025-04-17", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["committee-passage", "committee-passage-favorable"], "related_entities": [{"name": "Judiciary", "entity_type": "organization", "organization_id": null}]}, {"description": "Passed By Senate. Votes: 20 YES 1 ABSENT", "date": "2025-05-06", "organization_id": "~{\"classification\": \"upper\"}", "classification": ["passage"], "related_entities": []}, {"description": "Assigned to Judiciary Committee in House", "date": "2025-05-07", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["introduction", "referral-committee"], "related_entities": [{"name": "Judiciary", "entity_type": "organization", "organization_id": null}]}, {"description": "Reported Out of Committee (Judiciary) in House with 8 On Its Merits", "date": "2025-05-21", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["committee-passage"], "related_entities": [{"name": "Judiciary", "entity_type": "organization", "organization_id": null}]}, {"description": "Passed By House. Votes: 39 YES 1 ABSENT 1 VACANT", "date": "2025-06-25", "organization_id": "~{\"classification\": \"lower\"}", "classification": ["passage"], "related_entities": []}, {"description": "Signed by Governor", "date": "2025-06-30", "organization_id": "~{\"classification\": \"executive\"}", "classification": ["executive-signature"], "related_entities": []}], "sponsorships": [{"name": "Darius J. Brown", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Darius J. Brown\"}", "organization_id": null}, {"name": "Bryan Townsend", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Bryan Townsend\"}", "organization_id": null}, {"name": "Brian Pettyjohn", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Brian Pettyjohn\"}", "organization_id": null}, {"name": "William Bush", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"William Bush\"}", "organization_id": null}, {"name": "Nicole Poore", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Nicole Poore\"}", "organization_id": null}, {"name": "Claire Snyder-Hall", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"lower\", \"name\": \"Claire Snyder-Hall\"}", "organization_id": null}, {"name": "Spiros Mantzavinos", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Spiros Mantzavinos\"}", "organization_id": null}, {"name": "Trey Paradee", "classification": "primary", "entity_type": "person", "primary": true, "person_id": "~{\"chamber\": \"upper\", \"name\": \"Trey Paradee\"}", "organization_id": null}], "related_bills": [], "versions": [{"note": "Bill Text", "links": [{"url": "https://legis.delaware.gov/json/BillDetail/GenerateHtmlDocument?legislationId=142081&legislationTypeId=1&docTypeId=2&legislationName=SB95", "media_type": "text/html"}, {"url": "https://legis.delaware.gov/json/BillDetail/GeneratePdfDocument?legislationId=142081&legislationTypeId=1&docTypeId=2&legislationName=SB95", "media_type": "application/pdf"}], "date": "", "classification": ""}], "documents": [], "citations": [{"publication": "The Laws of Delaware", "citation": "Volume 85 Chapter 48", "citation_type": "chapter", "effective": null, "expires": null, "url": "https://legis.delaware.gov/SessionLaws/Chapter/GetPdfDocument?fileAttachmentId=650614"}], "sources": [{"url": "https://legis.delaware.gov/BillDetail?LegislationId=142081", "note": "text/html"}], "extras": {}, "jurisdiction": {"id": "ocd-jurisdiction/country:us/state:de/government", "name": "Delaware", "classification": "state", "division_id": "ocd-division/country:us/state:de"}, "scraped_at": "2025-11-26T06:10:53+00:00", "_id": "fca82f04-ca8d-11f0-8677-32549feb6cd6"}