{
  "legislative_session": "153",
  "identifier": "SB 97",
  "title": "AN ACT TO AMEND TITLE 6 OF THE DELAWARE CODE RELATING TO THE DELAWARE REVISED UNIFORM LIMITED PARTNERSHIP ACT.",
  "from_organization": "~{\"classification\": \"upper\"}",
  "classification": [
    "bill"
  ],
  "subject": [],
  "abstracts": [
    {
      "note": "synopsis",
      "abstract": "This Act continues the practice of amending periodically the Delaware Revised Uniform Limited Partnership Act (“LP Act”) to keep it current and to maintain its national preeminence. The following is a section-by-section review of proposed amendments to the LP Act.\r\n\r\nSection 1 amends § 17-104(e) of the LP Act, which addresses certain duties of a registered agent of a limited partnership. Amended § 17-104(e) specifies that a registered agent may not perform its duties or functions solely through the use of a virtual office, the retention by the agent of a mail forwarding service, or both. Amended § 17-104(e) defines “virtual office” as the performance of duties or functions solely through the internet or solely through other means of remote communication.\r\n\r\nSection 2 amends § 17-106(e) of the LP Act to provide that § 17-106(e) applies to ratification or waiver of a void or voidable act or transaction by any partner or other person in respect of a limited partnership, in addition to acts or transactions by a limited partnership. This Section also amends § 17-106(e) to provide that ratification or waiver pursuant to § 17-106(e) may be express or implied, including by the statements, action, inaction, or acquiescence of or by partners or other persons. Further, this Section amends § 17-106(e) to clarify that in a circumstance in which § 17-106(e) requires notice of the ratification or waiver to be given, the giving of the notice is not a condition to the effectiveness of the ratification or waiver. The amendments to § 17-106(e) in this Section are intended to provide rules different from the rules applied in existing case law that § 18-106(e) of the Delaware Limited Liability Company Act, which is the same in all material respects as § 17-106(e), is limited to ratification or waiver of a limited liability company’s own acts and transactions and that § 18-106(e) of the Delaware Limited Liability Company Act does not apply to ratification or waiver by conduct.\r\n\r\nSection 3 amends § 17-109(a) of the LP Act to provide that serving as a general partner of a limited partnership or as a liquidating trustee of a dissolved limited partnership is sufficient (without any requirement for execution by such person of the certificate of limited partnership) to (i) constitute such person’s consent to the appointment of the registered agent of the limited partnership (or, if there is none, the Secretary of State) as such person’s agent upon whom service of process may be made, and (ii) signify the consent of such general partner or liquidating trustee that any process when so served shall be of the same legal force and validity as if served upon such general partner or liquidating trustee within the State of Delaware.\r\n\r\nSection 4 amends § 17-202(f) of the LP Act to provide that at any time a person who is not shown as a general partner on the certificate of limited partnership of a dissolved limited partnership is winding up the limited partnership’s affairs, the certificate of limited partnership shall be amended to add the name and business, residence or mailing address of each liquidating trustee unless the limited partners are the liquidating trustees, in which case the certificate of limited partnership shall be amended to state that the limited partners are winding up the limited partnership’s affairs. This Section also amends § 17-202 of the LP Act to add a new § 17-202(g) to provide that at any time a person who is not shown as a general partner associated with a registered series on the certificate of registered series of a dissolved registered series is winding up the registered series’ affairs, the certificate of registered series shall be amended to add the name and business, residence or mailing address of each liquidating trustee of the registered series unless the limited partners associated with the registered series are the liquidating trustees, in which case the certificate of registered series shall be amended to state that the limited partners associated with the registered series are winding up the registered series’ affairs.\r\n\r\nSection 5 amends § 17-203(b) of the LP Act to confirm that, in addition to correcting a certificate of cancellation, a certificate of correction may nullify a certificate of cancellation.\r\n\r\nSection 6 amends § 17-204(a)(3) of the LP Act to delete language addressing who signs a certificate of cancellation when the general partners are not winding up a dissolved limited partnership’s affairs because that is now addressed in the new § 17-204(e) of the LP Act. This Section also amends § 17-204(a)(12) of the LP Act to delete language addressing who signs a certificate of cancellation of certificate of registered series when the general partners associated with such series are not winding up the dissolved registered series’ affairs because that is now addressed at new § 17-204(e) of the LP Act. This Section further amends § 17-204 of the LP Act to add a new §17-204(e). New § 17-204(e) provides who signs certificates required by the LP Act to be signed by one or more general partners of a dissolved limited partnership when a person not shown on the certificate of limited partnership as a general partner of the limited partnership is winding up the affairs of the limited partnership. New § 17-204(e) also provides who signs certificates required by the LP Act to be signed by one or more general partners associated with a dissolved registered series when a person not shown on the certificate of registered series as a general partner associated with the registered series is winding up the affairs of the registered series.\r\n\r\nSection 7 amends § 17-211(c) of the LP Act to provide that a certificate of limited partnership must be attached to a certificate of consolidation for a consolidation in which the resulting entity from such consolidation is a domestic limited partnership.\r\n\r\nSection 8 amends § 17-213(a) of the LP Act, which provides for the correction of certificates filed with the Secretary of State. The amendment confirms that, in addition to correcting a previously filed certificate, a certificate of correction may nullify a previously filed certificate by specifying the inaccuracy or defect with respect to such previously filed certificate and providing that the previously filed certificate is nullified. Such a provision is sufficient if it states that the previously filed certificate is nullified or void or uses words of similar meaning.\r\n\r\nSection 9 amends § 17-302(f) of the LP Act to confirm that a partnership agreement may be amended in connection with a division of a limited partnership and a merger of registered series of a limited partnership, as is specifically contemplated by §§ 17-220(f) and 17-224(e) of the LP Act, respectively.\r\n\r\nSection 10 amends § 17-902(1) of the LP Act to provide that an application for registration as a foreign limited partnership shall be executed by any person authorized to execute the application on behalf of the foreign limited partnership (which may or may not be a general partner of the foreign limited partnership).\r\n\r\nSection 11 amends § 17-905 of the LP Act to provide that a certificate correcting an inaccurate application for registration as a foreign limited partnership shall be executed by any person authorized to execute the certificate on behalf of the foreign limited partnership (which may or may not be a general partner of the foreign limited partnership).\r\n\r\nSection 12 amends § 17-906 of the LP Act to provide that a certificate of cancellation of registration as a foreign limited partnership shall be executed by any person authorized to execute the certificate on behalf of the foreign limited partnership (which may or may not be a general partner of the foreign limited partnership).\r\n\r\nSection 13 amends § 17-1109(b) of the LP Act to confirm that when the existence of a domestic limited partnership or registered series, or the registration of a foreign limited partnership, will cease by the filing of a certificate under the LP Act, the full amount of the annual tax for the calendar year in which such certificate becomes effective is due and payable prior to the filing of such certificate.\r\n\r\nSection 14 provides that the amendments to the LP Act take effect on August 1, 2025."
    }
  ],
  "other_titles": [
    {
      "note": "short title",
      "title": "Revised Uniform Limited Partnership Act/Updates"
    }
  ],
  "other_identifiers": [],
  "actions": [
    {
      "description": "Introduced and Assigned to Judiciary Committee in Senate",
      "date": "2025-04-08",
      "organization_id": "~{\"classification\": \"upper\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Judiciary",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Reported Out of Committee (Judiciary) in Senate with 2 Favorable, 2 On Its Merits",
      "date": "2025-04-17",
      "organization_id": "~{\"classification\": \"upper\"}",
      "classification": [
        "committee-passage",
        "committee-passage-favorable"
      ],
      "related_entities": [
        {
          "name": "Judiciary",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Passed By Senate. Votes: 20 YES 1 ABSENT",
      "date": "2025-05-06",
      "organization_id": "~{\"classification\": \"upper\"}",
      "classification": [
        "passage"
      ],
      "related_entities": [],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Assigned to Judiciary Committee in House",
      "date": "2025-05-07",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Judiciary",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Reported Out of Committee (Judiciary) in House with 8 On Its Merits",
      "date": "2025-05-21",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "committee-passage"
      ],
      "related_entities": [
        {
          "name": "Judiciary",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Passed By House. Votes: 39 YES 1 ABSENT 1 VACANT",
      "date": "2025-06-25",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "passage"
      ],
      "related_entities": [],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Signed by Governor",
      "date": "2025-06-30",
      "organization_id": "~{\"classification\": \"executive\"}",
      "classification": [
        "executive-signature"
      ],
      "related_entities": [],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    }
  ],
  "sponsorships": [
    {
      "name": "Darius J. Brown",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Darius J. Brown\"}",
      "organization_id": null
    },
    {
      "name": "Bryan Townsend",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Bryan Townsend\"}",
      "organization_id": null
    },
    {
      "name": "Brian Pettyjohn",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Brian Pettyjohn\"}",
      "organization_id": null
    },
    {
      "name": "Nicole Poore",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Nicole Poore\"}",
      "organization_id": null
    },
    {
      "name": "William Bush",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"William Bush\"}",
      "organization_id": null
    },
    {
      "name": "Claire Snyder-Hall",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Claire Snyder-Hall\"}",
      "organization_id": null
    },
    {
      "name": "Spiros Mantzavinos",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Spiros Mantzavinos\"}",
      "organization_id": null
    },
    {
      "name": "Trey Paradee",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Trey Paradee\"}",
      "organization_id": null
    }
  ],
  "related_bills": [],
  "versions": [
    {
      "note": "Bill Text",
      "links": [
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GenerateHtmlDocument?legislationId=142080&legislationTypeId=1&docTypeId=2&legislationName=SB97",
          "media_type": "text/html"
        },
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GeneratePdfDocument?legislationId=142080&legislationTypeId=1&docTypeId=2&legislationName=SB97",
          "media_type": "application/pdf"
        }
      ],
      "date": "",
      "classification": ""
    }
  ],
  "documents": [],
  "citations": [
    {
      "publication": "The Laws of Delaware",
      "citation": "Volume 85 Chapter 46",
      "citation_type": "chapter",
      "effective": null,
      "expires": null,
      "url": "https://legis.delaware.gov/SessionLaws/Chapter/GetPdfDocument?fileAttachmentId=650610"
    }
  ],
  "sources": [
    {
      "url": "https://legis.delaware.gov/BillDetail?LegislationId=142080",
      "note": "text/html"
    }
  ],
  "extras": {},
  "jurisdiction": {
    "id": "ocd-jurisdiction/country:us/state:de/government",
    "name": "Delaware",
    "classification": "state",
    "division_id": "ocd-division/country:us/state:de"
  },
  "_processing": {
    "logs_latest_update": "2025-11-26T06:11:35Z"
  }
}