{
  "legislative_session": "153",
  "identifier": "HB 14",
  "title": "AN ACT PROPOSING AN AMENDMENT TO ARTICLE I OF THE DELAWARE CONSTITUTION RELATING TO THE RIGHT OF INDIVIDUAL PRIVACY.",
  "from_organization": "~{\"classification\": \"lower\"}",
  "classification": [
    "bill"
  ],
  "subject": [],
  "abstracts": [
    {
      "note": "synopsis",
      "abstract": "This Act is the first leg of an amendment to the Delaware Constitution to make clear that the right of individual privacy is essential to the well-being of a free society and may not be infringed without a showing of a compelling state interest.\r\n\r\nThe U.S. Supreme Court has long interpreted the Fourteenth Amendment’s prohibition against the State depriving a person of life, liberty, or property without due process of law to prevent arbitrary or unreasonable action by the State. Specifically, in 1923, the Court, in Meyer v. Nebraska, 262 U.S. 390 stated:\r\n“While this Court has not attempted to define with exactness [of] the liberty thus guaranteed [under the Fourteenth Amendment], the term has received much consideration and some of the included things have been definitely stated. Without doubt, it denotes not merely freedom from bodily restraint but also the right of the individual to contract, to engage in any of the common occupations of life, to acquire useful knowledge, to marry, establish a home and bring up children, to worship God according to the dictates of his own conscience, and generally to enjoy those privileges long recognized at common law as essential to the orderly pursuit of happiness by free men.”\r\n\r\nIn the 1965 decision in Griswold v. Connecticut, 381 U.S. 479, the U.S. Supreme Court found that a law making the use of contraceptives a criminal offense violated the right to privacy. The Court held that within the Bill of Rights, \r\n“Various guarantees create zones of privacy. The right of association contained in the penumbra of the First Amendment is one, as we have seen. The Third Amendment in its prohibition against the quartering of soldiers ‘in any house’ in time of peace without the consent of the owner is another facet of that privacy. The Fourth Amendment explicitly affirms the ‘right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures.’ The Fifth Amendment in its Self-Incrimination Clause enables the citizen to create a zone of privacy which government may not force him to surrender to his detriment. The Ninth Amendment provides: ‘The enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.’\"\r\n\r\nMore recently, in Lawrence v. Texas, 539 U.S. 558 (2003), the Court stated that “our laws and tradition afford constitutional protection to personal decisions relating to marriage, procreation, contraception, family relationships, child rearing, and education.” In explaining the respect the Constitution demands for the autonomy of the person in making these choices, the Lawrence Court noted that the Court previous held that “[t]hese matters, involving the most intimate and personal choices a person may make in a lifetime, choices central to personal dignity and autonomy, are central to the liberty protected by the Fourteenth Amendment. At the heart of liberty is the right to define one’s own concept of existence, of meaning, of the universe, and of the mystery of human life.”\r\n\r\nIn reaching its ruling, the Lawrence Court held that the petitioners were “entitled to respect for their private lives. The State cannot demean their existence or control their destiny by making their private sexual conduct a crime. Their right to liberty under the Due Process Clause gives them the full right to engage in their conduct without intervention of the government. ‘It is a promise of the Constitution that there is a realm of personal liberty which the government may not enter.’”\r\n\r\nThe General Assembly proposes the enactment of this constitutional amendment guaranteeing a right of individual privacy to secure for Delawareans the rights the U.S. Supreme Court has previously found emanate from the federal constitution in the face of concerns regarding the continued effect of these U.S. Supreme Court precedents.\r\n\r\nAmending the Delaware Constitution requires not only the passing of the changes in this Act but also passage of the same changes after the next general election by the next General Assembly.\r\n\r\nThis Act requires a greater than majority vote for passage because § 1 of Article XVI of the Delaware Constitution requires the affirmative vote of two-thirds of the members elected to each house of the General Assembly to amend the Delaware Constitution."
    }
  ],
  "other_titles": [
    {
      "note": "short title",
      "title": "Right of Individual Privacy/Const. Amend./1st Leg"
    }
  ],
  "other_identifiers": [],
  "actions": [
    {
      "description": "Introduced and Assigned to Administration Committee in House",
      "date": "2025-01-23",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Administration",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    },
    {
      "description": "Reported Out of Committee (Administration) in House with 3 On Its Merits, 1 Unfavorable",
      "date": "2025-03-19",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "committee-passage",
        "committee-passage-unfavorable"
      ],
      "related_entities": [
        {
          "name": "Administration",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    }
  ],
  "sponsorships": [
    {
      "name": "Sean M. Lynn",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Sean M. Lynn\"}",
      "organization_id": null
    },
    {
      "name": "Claire Snyder-Hall",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Claire Snyder-Hall\"}",
      "organization_id": null
    },
    {
      "name": "Bryant L. Richardson",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Bryant L. Richardson\"}",
      "organization_id": null
    },
    {
      "name": "Melanie Ross Levin",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Melanie Ross Levin\"}",
      "organization_id": null
    }
  ],
  "related_bills": [],
  "versions": [
    {
      "note": "Bill Text",
      "links": [
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GenerateHtmlDocument?legislationId=141814&legislationTypeId=1&docTypeId=2&legislationName=HB14",
          "media_type": "text/html"
        },
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GeneratePdfDocument?legislationId=141814&legislationTypeId=1&docTypeId=2&legislationName=HB14",
          "media_type": "application/pdf"
        }
      ],
      "date": "",
      "classification": ""
    }
  ],
  "documents": [],
  "citations": [],
  "sources": [
    {
      "url": "https://legis.delaware.gov/BillDetail?LegislationId=141814",
      "note": "text/html"
    }
  ],
  "extras": {},
  "jurisdiction": {
    "id": "ocd-jurisdiction/country:us/state:de/government",
    "name": "Delaware",
    "classification": "state",
    "division_id": "ocd-division/country:us/state:de"
  },
  "_processing": {
    "logs_latest_update": "2025-11-26T06:11:35Z"
  }
}