{
  "legislative_session": "153",
  "identifier": "SB 169",
  "title": "AN ACT TO AMEND TITLE 3, TITLE 6, TITLE 9, TITLE 10, TITLE 11, TITLE 14, TITLE 16, TITLE 19, TITLE 21, TITLE 24, TITLE 26, TITLE 29, TITLE 30, AND TITLE 31 OF THE DELAWARE CODE, AND THE CHARTER OF THE TOWN OF NEWPORT, RELATING TO TECHNICAL CORRECTIONS.",
  "from_organization": "~{\"classification\": \"upper\"}",
  "classification": [
    "bill"
  ],
  "subject": [],
  "abstracts": [
    {
      "note": "synopsis",
      "abstract": "In December 2024, the Code Revisors provided the General Assembly with a list of potential technical corrections that they identified as they revised the Delaware Code to reflect legislation that was enacted by the 152nd General Assembly in 2024 or as they reviewed titles of the Code. While technical in nature, these changes are beyond the authority of the Code Revisors to make and can only be done by the General Assembly through legislation. This Act also includes technical corrections identified outside of the list provided by the Code Revisors.\r\n\r\nThis Act requires a greater than majority vote for passage to err on the side of caution because some of the sections of the Delaware Code being revised may require a super-majority vote under the Delaware Constitution.\r\n\r\nThis Act also makes also makes basic technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual.\r\n\r\nSection 1.  This section corrects errors in § 1202 of Title 3 from Senate Bill No. 191 from the 135th General Assembly by renumbering the defined terms to appear in correct alphabetical order and by making technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual style.\r\nSections 2 through 12.  These sections correct errors throughout Chapter 13 of Title 3 as enacted in Senate Bill No. 307 from the 138th General Assembly, and later amended, by making technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual style.\r\nSection 13.  This section corrects grouping and phrasing errors in § 2103(b) of Title 6 from Senate Bill No. 296 of the 152nd General Assembly. \r\nSection 14.  This section inserts use of the Oxford comma and the word “or” in § 4504(b)(1) of Title 6 as both had been missing in Senate Bill No. 315 of the 138th General Assembly and in order to adhere to Delaware Legislative Drafting Manual style.\r\nSection 15.  This section inserts use of the Oxford comma in § 1405(b) of Title 9 to correct errors in House Bill No. 55 from the 143rd General Assembly in order to adhere to Delaware Legislative Drafting Manual style.\r\nSection 16.  This section removes a reference to medical malpractice review panels in § 566(b) of Title 10, as those panels were discontinued by Senate Bill No. 208 of the 152nd General Assembly.\r\nSections 17 and 18.  These sections correct errors by removing the stray phrase “or projectile weapon” in the future contingent versions of §§ 2105(b)(3) and 2107(c) of Title 11. These errors were created when House Bill No. 357 of the 152nd General Assembly did not take into account changes contained in Senate Bill No. 12 of the 152nd  General Assembly.\r\nSection 19. This section corrects an error in § 1716E(h) of Title 14, from House Bill No. 100 of the 151st General Assembly, by inserting utilization of the Oxford comma.\r\nSection 20.  This section substitutes “subsection” for and erroneous reference to “paragraph” in § 3001(e)(4) of Title 14 as inserted by Senate Bill No. 305 of the 152nd General Assembly.\r\nSection 21. This section removes an unnecessary “et seq.” following a finite reference to “the federal Improving Head Start for School Readiness Act of 2007 (P.L. 110-134)” in § 3004 of Title 14 as inserted by Senate Bill No. 305 of the 152nd General Assembly.\r\nSections 22 through 24.  These sections complete the substitution of “perinatal” for “maternal” throughout Chapter 8D of Title 16, begun in Senate Substitute No. 1 of Senate Bill No. 106 of the 152nd  General Assembly, in order to remove gender-specific language as directed by § 211(c)(1) of Title 1 and the Delaware Legislative Drafting Manual style.\r\nSections 25 and 26. These sections substitute the indefinite “et seq.” for “through 1396w-7” in § 1304(b) and (c)(1)  and § 1045(d)(2)f. and (e)(1) of Title 16 in order to acknowledge the need to comply with all of Title XIX of the federal Social Security Act which has grown since enactment of Senate Substitute No. 1 for Senate Bill No. 13 of the 152nd General Assembly which had created the more finite reference to what was then the final section of the title.\r\nSection 27. This section properly substitutes penalty amounts in § 1109(e) of Title 16 which had been improperly substituted by Senate Bill No. 216 of the 152nd General Assembly without appropriate striking of present language and underlining of new insertions.\r\nSection 28. This section corrects an error in § 2503B(c) of Title 16, from Senate Bill No. 309 from the 152nd General Assembly, by substituting “or” for “and” to make it clear that any of among a health-care institution, health-care professional, or certified peer recovery specialist may assist an individual with creating an advance mental health-care directive. \r\nSection 29.  This section corrects an error in § 2704 of Title 16 created by House Bill No. 134 of the 152nd General Assembly having previously changed language included in House Substitute No. 1 for House Bill 162 of the 152nd General Assembly by enacting the intent of the latter bill, giving county medical examiner offices authority previously given to the Division of Forensic Science.\r\nSection 30 through 34. These sections correct stylistic errors in Chapter 102 of Title 16, from House Bill No. 57 of the 144th General Assembly, by conforming all “2-1-1 Helpline” references to accepted style without hyphenation as approved by the Federal Communications Commission and by making adjustments in line with proper Delaware Legislative Drafting Manual style.\r\nSection 35.  This section corrects an error in § 2379(g) of Title 19 by properly striking “an” which was removed without appropriate striking in Senate Bill No. 306 of the 152nd General Assembly.\r\nSection 36. This section properly enacts the specific intent of Senate Bill No. 206 of the 152nd General Assembly by substituting “cold weather operations” for “winter weather operations” in § 4356A(b)(3) of Title 21.\r\nSection 37.  This section corrects an error in § 4402(d) of Title 21, created by House Bill No. 352 of the 152nd General Assembly, by properly inserting “county code enforcement or municipal police” using appropriate underlining of the new insertion.\r\nSection 38.  This section corrects an error in the introductory paragraph of § 5302 of Title 24, from House Bill No. 386 of the 152nd General Assembly, by making clear that the defined terms in the section apply to all of Chapter 53 of Title 24 and not just to § 5302 of that title.\r\nSection 39.  This section corrects errors in § 363(b) of Title 26 by deleting words which were removed by Senate Bill No. 265 of the 152nd General without appropriate striking of the present language.\r\nSection 40.  This section corrects errors in § 108(b)(2) of Title 29, created by House Substitute No. 1 of House Bill No. 356 of the 152nd General Assembly, by adjusting paragraph designations and an internal reference as directed by the Delaware Legislative Drafting Manual.\r\nSection 41.  This section corrects an error in § 1132 of Title 29, first appearing in House Bill No. 209 of the 137th General Assembly, by inserting an introductory paragraph to this defined terms statute as directed by the Delaware Legislative Drafting Manual.\r\nSection 42.  This section corrects an error in § 2909(b)(3) of Title 29, from Senate Bill No. 287 of the 152nd General Assembly, by substituting “or” for “and” with regard to documentation of illegal or unbusinesslike practices included in State Auditor reports.\r\nSection 43.  This section corrects errors in § 6981(l) of Title 29, from House Bill No. 428 of the 152nd General Assembly, by adjusting language of list inclusion as directed by the Delaware Legislative Drafting Manual.\r\nSection 44. This section makes grammar and capitalization corrections throughout § 8011 of Title 29, from House Bill No. 439 of the 151st General Assembly, as directed by the Delaware Legislative Drafting Manual.\r\nSection 45.  This section corrects an error in § 8723(g) of Title 29, from House Bill No. 437 of the 152nd General Assembly, by making clear that the Delaware Commission of Veterans’ Affairs Executive Director’s designee may act in the Executive Director’s stead in performance of certain duties.\r\nSections 46 and 47. These sections make grammar and capitalization corrections throughout the present and future versions of § 8905 of Title 29, from House Bill No. 439 of the 151st General Assembly, as directed by the Delaware Legislative Drafting Manual.\r\nSections 48 and 49. These sections correct errors in §§ 573(d) and 574(b) of Title 30, from House Bill No. 324 of the 152nd General Assembly, by making clear that the statutes do not apply if a person is required to pay a tax under any of § 3002 of Title 30 or Chapter 51 or 52 of Title 30, rather than under all of those provisions.\r\nSection 50.  This section corrects errors in § 4071 of Title 31, from Senate Substitute No. 1 for Senate Bill 22 of the 152nd General Assembly, by inserting an introductory paragraph to this defined terms statute and redesignating the terms as directed by the Delaware Legislative Drafting Manual.\r\nSections 51 through 56. These sections correct errors in the Charter of the Town of Newport from Senate Bill No. 298 of the 152nd General Assembly by implementing changes which had been included without proper underlining of insertions and striking of deletions and by making technical corrections to conform existing law to the standards of the Delaware Legislative Drafting Manual style."
    }
  ],
  "other_titles": [
    {
      "note": "short title",
      "title": "Technical Corrections/Legislative Council"
    }
  ],
  "other_identifiers": [],
  "actions": [
    {
      "description": "Introduced and Assigned to Executive Committee in Senate",
      "date": "2025-06-05",
      "organization_id": "~{\"classification\": \"upper\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Executive",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    },
    {
      "description": "Reported Out of Committee (Executive) in Senate with 1 Favorable, 6 On Its Merits",
      "date": "2025-06-11",
      "organization_id": "~{\"classification\": \"upper\"}",
      "classification": [
        "committee-passage",
        "committee-passage-favorable"
      ],
      "related_entities": [
        {
          "name": "Executive",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    },
    {
      "description": "Passed By Senate. Votes: 18 YES 1 NOT VOTING 2 ABSENT",
      "date": "2025-06-12",
      "organization_id": "~{\"classification\": \"upper\"}",
      "classification": [
        "passage"
      ],
      "related_entities": [],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    },
    {
      "description": "Assigned to Administration Committee in House",
      "date": "2025-06-12",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Administration",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    },
    {
      "description": "Reported Out of Committee (Administration) in House with 5 On Its Merits",
      "date": "2025-06-25",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "committee-passage"
      ],
      "related_entities": [
        {
          "name": "Administration",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    },
    {
      "description": "Passed By House. Votes: 40 YES 1 VACANT",
      "date": "2025-06-30",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "passage"
      ],
      "related_entities": [],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    },
    {
      "description": "Signed by Governor",
      "date": "2025-07-01",
      "organization_id": "~{\"classification\": \"executive\"}",
      "classification": [
        "executive-signature"
      ],
      "related_entities": [],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:36Z"
      }
    }
  ],
  "sponsorships": [
    {
      "name": "David P. Sokola",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"David P. Sokola\"}",
      "organization_id": null
    },
    {
      "name": "Bryan Townsend",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Bryan Townsend\"}",
      "organization_id": null
    },
    {
      "name": "Josue O Ortega",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Josue O Ortega\"}",
      "organization_id": null
    },
    {
      "name": "Stell Parker Selby",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Stell Parker Selby\"}",
      "organization_id": null
    },
    {
      "name": "Brian Pettyjohn",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Brian Pettyjohn\"}",
      "organization_id": null
    },
    {
      "name": "Trey Paradee",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"upper\", \"name\": \"Trey Paradee\"}",
      "organization_id": null
    },
    {
      "name": "Kerri Evelyn Harris",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Kerri Evelyn Harris\"}",
      "organization_id": null
    },
    {
      "name": "Edward S. Osienski",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Edward S. Osienski\"}",
      "organization_id": null
    },
    {
      "name": "Timothy D. Dukes",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Timothy D. Dukes\"}",
      "organization_id": null
    }
  ],
  "related_bills": [],
  "versions": [
    {
      "note": "Bill Text",
      "links": [
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GenerateHtmlDocument?legislationId=142406&legislationTypeId=1&docTypeId=2&legislationName=SB169",
          "media_type": "text/html"
        },
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GeneratePdfDocument?legislationId=142406&legislationTypeId=1&docTypeId=2&legislationName=SB169",
          "media_type": "application/pdf"
        }
      ],
      "date": "",
      "classification": ""
    }
  ],
  "documents": [],
  "citations": [
    {
      "publication": "The Laws of Delaware",
      "citation": "Volume 85 Chapter 68",
      "citation_type": "chapter",
      "effective": null,
      "expires": null,
      "url": "https://legis.delaware.gov/SessionLaws/Chapter/GetPdfDocument?fileAttachmentId=650678"
    }
  ],
  "sources": [
    {
      "url": "https://legis.delaware.gov/BillDetail?LegislationId=142406",
      "note": "text/html"
    }
  ],
  "extras": {},
  "jurisdiction": {
    "id": "ocd-jurisdiction/country:us/state:de/government",
    "name": "Delaware",
    "classification": "state",
    "division_id": "ocd-division/country:us/state:de"
  },
  "_processing": {
    "logs_latest_update": "2025-11-26T06:11:36Z"
  }
}