{
  "legislative_session": "153",
  "identifier": "HB 184",
  "title": "AN ACT TO AMEND TITLE 29 OF THE DELAWARE CODE RELATING TO THE REDISTRICTING OF THE GENERAL ASSEMBLY.",
  "from_organization": "~{\"classification\": \"lower\"}",
  "classification": [
    "bill"
  ],
  "subject": [],
  "abstracts": [
    {
      "note": "synopsis",
      "abstract": "The constitutional requirement to create new legislative districts following the U.S. Census was intended to ensure equal representation at all levels of government. However, Delaware’s current process of redistricting is deeply flawed. It allows the majority party in each legislative chamber to gerrymander state legislative maps in a self-serving attempt to preserve and expand partisan political power. All other considerations have become secondary in this process. This defect is common to many states and some have tried to address the issue by creating election commissions charged with redrawing legislative lines. The challenge in such a system is ensuring that these commissions can conduct their function in a balanced, objective, and non-partisan fashion. This bill proposes a new method that avoids this significant hurdle by leveraging partisan self-interest to create a protocol that results in an equitable outcome. This fresh approach to reapportionment is described in a paper by 3 Carnegie Mellon University professors entitled: “A Partisan Districting Protocol with Provably Nonpartisan Outcomes.” It utilizes a system analogous to a proven, prudent method for instructing 2 children to fairly divide a piece of cake between themselves. The first child cuts the cake, while the second has the option of selecting which piece he or she wishes to consume. In the protocol outlined in this bill, the two competing parties are the partisan caucuses of each General Assembly chamber. The first caucus will initially draw all the legislative districts, observing established legal redistricting standards. The second caucus will have the ability to “freeze” a set number of the districts, locking their boundaries into place. They will then be able to redraw the remaining districts as they wish, delivering the new maps back to the first caucus. This group will then also engage in the freeze and redraw process, with the cycles continuing until all the districts have been defined. With both sides getting equal “bites of the apple,” each has a practical ability to affect the outcome and a reason to work together to achieve a mutually acceptable conclusion. The bill also includes safeguards to ensure public notification and participation in the process, as well as a contingency to allow the judicial branch to draw the new legislative maps should the General Assembly be unable to achieve the task. This legislation assumes calling the General Assembly into special session to approve the finalized maps, providing enough time for the process to be conducted in a deliberative manner."
    }
  ],
  "other_titles": [],
  "other_identifiers": [],
  "actions": [
    {
      "description": "Introduced and Assigned to Administration Committee in House",
      "date": "2025-06-05",
      "organization_id": "~{\"classification\": \"lower\"}",
      "classification": [
        "introduction",
        "referral-committee"
      ],
      "related_entities": [
        {
          "name": "Administration",
          "entity_type": "organization",
          "organization_id": null
        }
      ],
      "_processing": {
        "log_file_created": "2025-11-26T06:11:35Z"
      }
    }
  ],
  "sponsorships": [
    {
      "name": "Michael F. Smith",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Michael F. Smith\"}",
      "organization_id": null
    },
    {
      "name": "Franklin D. Cooke",
      "classification": "primary",
      "entity_type": "person",
      "primary": true,
      "person_id": "~{\"chamber\": \"lower\", \"name\": \"Franklin D. Cooke\"}",
      "organization_id": null
    }
  ],
  "related_bills": [],
  "versions": [
    {
      "note": "Bill Text",
      "links": [
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GenerateHtmlDocument?legislationId=142392&legislationTypeId=1&docTypeId=2&legislationName=HB184",
          "media_type": "text/html"
        },
        {
          "url": "https://legis.delaware.gov/json/BillDetail/GeneratePdfDocument?legislationId=142392&legislationTypeId=1&docTypeId=2&legislationName=HB184",
          "media_type": "application/pdf"
        }
      ],
      "date": "",
      "classification": ""
    }
  ],
  "documents": [],
  "citations": [],
  "sources": [
    {
      "url": "https://legis.delaware.gov/BillDetail?LegislationId=142392",
      "note": "text/html"
    }
  ],
  "extras": {},
  "jurisdiction": {
    "id": "ocd-jurisdiction/country:us/state:de/government",
    "name": "Delaware",
    "classification": "state",
    "division_id": "ocd-division/country:us/state:de"
  },
  "_processing": {
    "logs_latest_update": "2025-11-26T06:11:35Z"
  }
}